HoangQuan152000/auto_home_itplus/source/smart_home_stm32/Core/Inc/main.h
/* USER CODE BEGIN Header */
/**
  ******************************************************************************
  * @file           : main.h
  * @brief          : Header for main.c file.
  *                   This file contains the common defines of the application.
  ******************************************************************************
  * @attention
  *
  * Copyright (c) 2023 STMicroelectronics.
  * All rights reserved.
  *
  * This software is licensed under terms that can be found in the LICENSE file
  * in the root directory of this software component.
  * If no LICENSE file comes with this software, it is provided AS-IS.
  *
  ******************************************************************************
  */
/* USER CODE END Header */

/* Define to prevent recursive inclusion -------------------------------------*/
#ifndef __MAIN_H
#define __MAIN_H

#ifdef __cplusplus
extern "C" {
#endif

/* Includes ------------------------------------------------------------------*/
#include "stm32f1xx_hal.h"

/* Private includes ----------------------------------------------------------*/
/* USER CODE BEGIN Includes */

/* USER CODE END Includes */

/* Exported types ------------------------------------------------------------*/
/* USER CODE BEGIN ET */

/* USER CODE END ET */

/* Exported constants --------------------------------------------------------*/
/* USER CODE BEGIN EC */

/* USER CODE END EC */

/* Exported macro ------------------------------------------------------------*/
/* USER CODE BEGIN EM */

/* USER CODE END EM */

void HAL_TIM_MspPostInit(TIM_HandleTypeDef *htim);

/* Exported functions prototypes ---------------------------------------------*/
void Error_Handler(void);

/* USER CODE BEGIN EFP */

/* USER CODE END EFP */

/* Private defines -----------------------------------------------------------*/
#define MOVE_SS_Pin GPIO_PIN_15
#define MOVE_SS_GPIO_Port GPIOC
#define INFRARED_2_Pin GPIO_PIN_0
#define INFRARED_2_GPIO_Port GPIOA
#define DHT11_Pin GPIO_PIN_1
#define DHT11_GPIO_Port GPIOA
#define BUTTON_MOVE_Pin GPIO_PIN_2
#define BUTTON_MOVE_GPIO_Port GPIOA
#define BUTTON_MOVE_EXTI_IRQn EXTI2_IRQn
#define BUTTON_DOOR_1_Pin GPIO_PIN_3
#define BUTTON_DOOR_1_GPIO_Port GPIOA
#define BUTTON_DOOR_1_EXTI_IRQn EXTI3_IRQn
#define BUTTON_LIGHT_Pin GPIO_PIN_4
#define BUTTON_LIGHT_GPIO_Port GPIOA
#define BUTTON_LIGHT_EXTI_IRQn EXTI4_IRQn
#define BUTTON_FAN_Pin GPIO_PIN_5
#define BUTTON_FAN_GPIO_Port GPIOA
#define BUTTON_FAN_EXTI_IRQn EXTI9_5_IRQn
#define IN2_Pin GPIO_PIN_7
#define IN2_GPIO_Port GPIOA
#define INFRARED_1_Pin GPIO_PIN_0
#define INFRARED_1_GPIO_Port GPIOB
#define STEP_IN1_Pin GPIO_PIN_12
#define STEP_IN1_GPIO_Port GPIOB
#define STEP_IN2_Pin GPIO_PIN_13
#define STEP_IN2_GPIO_Port GPIOB
#define STEP_IN3_Pin GPIO_PIN_14
#define STEP_IN3_GPIO_Port GPIOB
#define STEP_IN4_Pin GPIO_PIN_15
#define STEP_IN4_GPIO_Port GPIOB
#define BUTTON_DOOR_2_Pin GPIO_PIN_10
#define BUTTON_DOOR_2_GPIO_Port GPIOA
#define BUTTON_DOOR_2_EXTI_IRQn EXTI15_10_IRQn

/* USER CODE BEGIN Private defines */

/* USER CODE END Private defines */

#ifdef __cplusplus
}
#endif

#endif /* __MAIN_H */
